{"highlights": [{"title": "The Alchemist (Coelho, Paulo)", "page": ["79"], "location": ["974"], "highlight": "You should pay more attention to the caravan,", "date": "10/22/2018"}, {"title": "The Alchemist (Coelho, Paulo)", "page": ["154"], "location": ["1874", "1873"], "highlight": "turned himself into the wind, almost destroying a military", "date": "12/11/2018"}, {"title": "The War of Art (Pressfield, Steven)", "page": ["12"], "location": ["168", "167"], "highlight": "Rule of thumb: The more important a call or action is to our soul's evolution, the more Resistance we will feel toward pursuing it.", "date": "02/13/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["57", "58"], "highlight": "will always have problems, many of them hidden from our view; that we work hard to uncover these problems, even if doing so means making ourselves uncomfortable; and that, when we come across a problem, we marshal all of our energies to solve", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["57", "58"], "highlight": "will always have problems, many of them hidden from our view; that we work hard to uncover these problems, even if doing so means making ourselves uncomfortable; and that, when we come across a problem, we marshal all of our energies to solve it. This,", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["57", "58"], "highlight": "will always have problems, many of them hidden from our view; that we work hard to uncover these problems, even if doing so means making ourselves uncomfortable; and that, when we come across a problem, we marshal all of our energies to solve it. This,", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["57", "58"], "highlight": "will always have problems, many of them hidden from our view; that we work hard to uncover these problems, even if doing so means making ourselves uncomfortable; and that, when we come across a problem, we marshal all of our energies to solve it.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["143", "145"], "highlight": "believe the best managers acknowledge and make room for what they do not knownot just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["143", "145"], "highlight": "see. I believe the best managers acknowledge and make room for what they do not knownot just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["143", "145"], "highlight": "see. I believe the best managers acknowledge and make room for what they do not knownot just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["143", "145"], "highlight": "see. I believe the best managers acknowledge and make room for what they do not knownot just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["143", "145"], "highlight": "see. I believe the best managers acknowledge and make room for what they do not knownot just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["143", "145"], "highlight": "I believe the best managers acknowledge and make room for what they do not knownot just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.", "date": "05/08/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["586", "587"], "highlight": "Another of his favorite analogies was that building a company was like being on a wagon train headed west. On the long journey to the land", "date": "05/10/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["1244", "1243"], "highlight": "Find, develop, and support good people, and they in turn will find, develop, and own good ideas.", "date": "05/14/2019"}, {"title": "Creativity, Inc. (Catmull, Ed)", "page": [], "location": ["1757", "1758"], "highlight": "While we dont want too many failures, we must think of the cost of failure as an investment in the future.", "date": "05/18/2019"}, {"title": "Ready Player One (Cline, Ernest)", "page": ["62"], "location": ["1069", "1071"], "highlight": "Douglas Adams. Kurt Vonnegut. Neal Stephenson. Richard K. Morgan. Stephen King. Orson Scott Card. Terry Pratchett. Terry Brooks. Bester, Bradbury, Haldeman, Heinlein, Tolkien, Vance, Gibson, Gaiman, Sterling, Moorcock, Scalzi, Zelazny.", "date": "11/07/2019"}, {"title": "Ready Player One (Cline, Ernest)", "page": ["62"], "location": ["1074", "1075"], "highlight": "Star Wars (original and prequel trilogies, in that order), Lord of the Rings, The Matrix, Mad Max, Back to the Future, and Indiana Jones.", "date": "11/07/2019"}, {"title": "Ready Player One (Cline, Ernest)", "page": ["62"], "location": ["1078", "1077"], "highlight": "Cameron, Gilliam, Jackson, Fincher, Kubrick, Lucas, Spielberg, Del Toro, Tarantino. And, of course, Kevin Smith.", "date": "11/07/2019"}, {"title": "Astrophysics for People in a Hurry (de Grasse Tyson, Neil)", "page": ["25"], "location": ["112", "111"], "highlight": "but with extraordinary consequences. As the universe continued to cool, the amount", "date": "12/27/2019"}, {"title": "Astrophysics for People in a Hurry (de Grasse Tyson, Neil)", "page": ["45"], "location": ["275", "276"], "highlight": "In other words, after the laws of physics, everything else is opinion.", "date": "12/28/2019"}, {"title": "The Martian (Weir, Andy)", "page": ["211"], "location": ["3192", "3191"], "highlight": "They all looked to Lewis. I wont lie, she said. Id sure as hell like", "date": "01/14/2020"}, {"title": "The Count of Monte Cristo (Dumas, Alexandre)", "page": ["13"], "location": ["598"], "highlight": "hopes, Fernand; you cannot reproach me with one coquettish", "date": "02/10/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["3"], "location": [], "highlight": "Object-oriented design is about managing dependencies. It is a set of coding techniques that arrange dependencies such that objects can tolerate change", "date": "05/17/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["6"], "location": [], "highlight": "The so-called Gang of Four (Gof), Erich Gamma, Richard Helm, Ralph Johnson, and Jon Vlissides, wrote the seminal work on patterns in 1995. Their Design Patterns", "date": "05/17/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["10"], "location": [], "highlight": "There are numerous Ruby gems (a google search on ruby metrics will turn up the most recent) that assess how well your code follows OOD principles. Metrics software works by scanning source code and counting things that predict quality. Running a metrics suite against your own code can be illuminating, humbling, and sometimes alarming", "date": "05/17/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["39"], "location": [], "highlight": "to combine there with a spice-based rug. It had not been a felicitous", "date": "05/17/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["39"], "location": [], "highlight": "to combine there with a spice-based rug. It had not been a felicitous", "date": "05/17/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["22"], "location": [], "highlight": "Another way to hone in on what a class is actually doing is to attempt to describe it in one sentence.", "date": "05/18/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["22"], "location": [], "highlight": "Another way to hone in on what a class is actually doing is to attempt to describe it in one sentence. Remember that a class should do the smallest possible useful thing. That thing ought to be simple to describe", "date": "05/18/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["40"], "location": [], "highlight": "must also change. On the face of it this dependency seems innocuous", "date": "05/18/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["102"], "location": [], "highlight": "but muddy water was muddy water. And there was always the Litany", "date": "05/19/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["110"], "location": [], "highlight": ". To pilgrims who seek her out with demands that she restore virility", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["53"], "location": [], "highlight": "depend on things that change less often than you do.", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["53"], "location": [], "highlight": "Pretend for a moment that your classes are people. If you were to give them advice about how to behave you would tell them to depend on things that change less often than you do.", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["57"], "location": [], "highlight": "Depend on things that change less often than you do is a heuristic that stands in for all the ideas in this section. The", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["64"], "location": [], "highlight": "These classes spring to mind because they represent nouns in the application that have both data and behavior. Call them domain objects", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["64"], "location": [], "highlight": "Design experts notice domain objects without concentrating on them; they focus not on these objects but on the messages that pass between them. These messages are guides that lead you to discover other objects, ones that are just as necessary but far less obvious.", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["67"], "location": [], "highlight": "This transition from class-based design to message-based design is a turning point in your design career. The message-based perspective yields more flexible applications than does the class-based perspective. Changing the fundamental design question from I know I need this class, what should it do? to I need to send this message, who should respond to it? is the first step in that direction.", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["78"], "location": [], "highlight": "survive the test of time. If the illusion of control is a comfort, feel free to use the keywords.However", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["78"], "location": [], "highlight": "However, many perfectly competent Ruby programmers omit them and instead use comments or a special method naming convention (Ruby on Rails, for example, adds a leading _ to private methods) to indicate the public and private parts of interfaces.", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["80"], "location": [], "highlight": "The Law of Demeter (LoD) is a set of coding rules that results in loosely coupled objects. Loose coupling is nearly always a virtue but is just one component of design and must be balanced against competing needs. Some Demeter violations are harmless, but others expose a failure to correctly identify and define public interfaces.", "date": "05/19/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["80"], "location": [], "highlight": "Demeter is often paraphrased as only talk to your immediate neighbors or use only one dot. ", "date": "05/19/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["136"], "location": [], "highlight": "Stilgar asked. He felt resentment grow at what he interpreted as caprice", "date": "05/19/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["170"], "location": [], "highlight": "The flesh surrenders itself, he thought. Eternity takes back its own. Our bodies stirred these waters briefly, danced with a certain intoxication before the love of life and self, dealt with a few strange ideas, then submitted to the instruments of Time. What can we say of this? I occurred. I am not . . . yet, I occurred.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["85"], "location": [], "highlight": "Duck types are public interfaces that are not tied to any specific class. These across-class interfaces add enormous flexibility to your application by replacing costly dependencies on class with more forgiving dependencies on messages. Duck typed objects are chameleons that are defined more by their behavior than by their class.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["86"], "location": [], "highlight": "An instance of the Mechanic class contains, obviously, the complete public interface of Mechanic. It is blindingly apparent that any object holding onto an instance of Mechanic can treat the instance as if it is a Mechanic; the object, by its very nature, implements the Mechanic classs public interface.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["86"], "location": [], "highlight": "Users of an object need not, and should not, be concerned about its class. Class is just one way for an object to acquire a public interface; the public interface an object obtains by way of its class may be one of several that it contains", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["86"], "location": [], "highlight": "Its not what an object is that matters, its what it does.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["86"], "location": [], "highlight": "did those of within-class types back in Chapter 4, Creating Flexible Interfaces.Across", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["86"], "location": [], "highlight": "Across-class types, duck types, have public interfaces that represent a contract that must be explicit and well-documented.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["94"], "location": [], "highlight": "This tension between the costs of concretion and the costs of abstraction is fundamental to object-oriented design. Concrete code is easy to understand but costly to extend. Abstract code may initially seem more obscure but, once understood, is far easier to change. Use of a duck type moves your code along the scale from more concrete to more abstract, making the code easier to extend but casting a veil over the underlying class of the duck", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["96"], "location": [], "highlight": "Several common coding patterns indicate the presence of a hidden duck. You can replace the following with ducks:  Case statements that switch on class  kind_of? and is_a?  responds_to?", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["98"], "location": [], "highlight": "Flexible applications are built on objects that operate on trust; it is your job to make your objects trustworthy. When you see these code patterns, concentrate on the offending codes expectations and use those expectations to find the duck type. Once you have a duck type in mind, define its interface, implement that interface where necessary, and then trust those implementers to behave correctly", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["104"], "location": [], "highlight": "Messages are at the center of object-oriented applications and they pass among objects along public interfaces. Duck typing detaches these public interfaces from specific classes, creating virtual types that are defined by what they do instead of by who they are", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["111"], "location": [], "highlight": "You can think of the class of an object as merely a specific case of an attribute that holds the category of self", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["117"], "location": [], "highlight": "For inheritance to work, two things must always be true.First, the objects that you are modeling must truly have a generalizationspecialization relationship.Second, you must use the correct coding techniques.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["118"], "location": [], "highlight": "Abstract classes exist to be subclassed. This is their sole purpose. They provide a common repository for behavior that is shared across a set of subclassessubclasses that in turn supply specializations", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["118"], "location": [], "highlight": "Even though you now have a requirement for two kinds of bikes, this still may not be the right moment to commit to inheritance. Creating a hierarchy has costs; the best way to minimize these costs is to maximize your chance of getting the abstraction right before allowing subclasses to depend on it.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["123"], "location": [], "highlight": "The general rule for refactoring into a new inheritance hierarchy is to arrange code so that you can promote abstractions rather than demote concretions.", "date": "05/20/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["134"], "location": [], "highlight": "Instead of allowing subclasses to know the algorithm and requiring that they send super, superclasses can instead send hook messages, ones that exist solely to provide subclasses a place to contribute information by implementing matching methods.", "date": "05/21/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["143"], "location": [], "highlight": "Many object-oriented languages provide a way to define a named group of methods that are independent of class and can be mixed in to any object. In Ruby, these mix-ins are called modules", "date": "05/21/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["143"], "location": [], "highlight": "Many object-oriented languages provide a way to define a named group of methods that are independent of class and can be mixed in to any object. In Ruby, these mix-ins are called modules. Methods can be defined in a module and then the module can be added to any object. Modules thus provide a perfect way to allow objects of different classes to play a common role using a single set of code", "date": "05/21/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["213"], "location": [], "highlight": "prodigious filing systems. Expediency was the first word in his catechism", "date": "05/22/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["160"], "location": [], "highlight": "Mathematicians will instantly comprehend this statement; everyone else should understand it to say that in order for a type system to be sane, subtypes must be substitutable for their supertypes.", "date": "05/22/2020"}, {"title": "Practical Object-Oriented Design in Ruby_ An Agile Primer - Sandi Metz", "page": ["161"], "location": [], "highlight": "Avoid writing code that requires its inheritors to send super; instead use hook messages to allow subclasses to participate while absolving them of responsibility for knowing the abstract algorithm.Inheritance, by its very nature, adds powerful dependencies on the structure and arrangement of code. Writing code that requires subclasses to send super adds an additional dependency; avoid this if you can.", "date": "05/22/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["273"], "location": [], "highlight": "Bijaz managed between giggles. \"Having no teeth, I could not gnash", "date": "05/26/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["273"], "location": [], "highlight": "Bijaz managed between giggles. \"Having no teeth, I could not gnash", "date": "05/26/2020"}, {"title": "Frank Herbert - Dune 2 - Dune M - menon", "page": ["311"], "location": [], "highlight": "He was a puppet held fast by strings reaching down from that awful corona.", "date": "05/27/2020"}, {"title": "An Astronaut's Guide to Life on Earth (Hadfield, Chris)", "page": ["52"], "location": ["644", "646"], "highlight": "In my experience, fear comes from not knowing what to expect and not feeling you have any control over whats about to happen. When you feel helpless, youre far more afraid than you would be if you knew the facts. If youre not sure what to be alarmed about, everything is alarming.", "date": "06/13/2020"}, {"title": "Talking to Strangers (Gladwell, Malcolm)", "page": ["19"], "location": ["221"], "highlight": "Soviet Unionwas so sensitive that twice after his defection", "date": "06/15/2020"}, {"title": "Talking to Strangers (Gladwell, Malcolm)", "page": ["50"], "location": ["563", "565"], "highlight": "We think we can easily see into the hearts of others based on the flimsiest of clues. We jump at the chance to judge strangers. We would never do that to ourselves, of course. We are nuanced and complex and enigmatic. But the stranger is easy. If I can convince you of one thing in this book, let it be this: Strangers are not easy.", "date": "06/18/2020"}, {"title": "Walden (Henry David Thoreau)", "page": ["21"], "location": ["319", "320"], "highlight": "Old shoes will serve a hero longer than they have served his valetif a hero ever has a valetbare feet are older than shoes, and he can make them do.", "date": "12/23/2020"}, {"title": "The Headspace Guide to Meditation and Mindfulness (Puddicombe, Andy)", "page": ["27"], "location": ["410", "408"], "highlight": "This is why training the mind is so important. By changing the way in which you see the world, you effectively change the world around you.", "date": "01/18/2021"}, {"title": "The Headspace Guide to Meditation and Mindfulness (Puddicombe, Andy)", "page": ["34"], "location": ["508", "507"], "highlight": "time goes by, have the intention to make it a more altruistic", "date": "01/18/2021"}, {"title": "The Headspace Guide to Meditation and Mindfulness (Puddicombe, Andy)", "page": ["34"], "location": ["508", "507"], "highlight": "time goes by, have the intention to make it a more altruistic", "date": "01/18/2021"}, {"title": "The Headspace Guide to Meditation and Mindfulness (Puddicombe, Andy)", "page": ["51"], "location": ["793", "795"], "highlight": "If you can give up your desire to always experience pleasant things, at the same time as giving up your fear of experiencing unpleasant things, then youll have a quiet mind.", "date": "01/18/2021"}, {"title": "A Farewell to Arms (Ernest Hemingway)", "page": ["80"], "location": ["1052", "1053"], "highlight": "The Italians put it under the arm,", "date": "06/08/2021"}, {"title": "A Farewell to Arms (Ernest Hemingway)", "page": ["106"], "location": ["1404", "1405"], "highlight": "we had many small ways of making love and we tried putting thoughts in the other ones head while we were in different rooms. It seemed to work sometimes but that was probably because we were thinking the same thing anyway.", "date": "06/09/2021"}, {"title": "A Farewell to Arms (Ernest Hemingway)", "page": ["108"], "location": ["1426", "1427"], "highlight": "Dont talk as though you had to make an honest woman of me, darling. Im a very honest woman. You cant be ashamed of something if youre only happy and proud of it.", "date": "06/09/2021"}, {"title": "A Farewell to Arms (Ernest Hemingway)", "page": ["166"], "location": ["2229", "2228"], "highlight": "Thats why I never think about these things. I never think and yet when I begin to talk I say the things I have found out in my mind without thinking.", "date": "06/20/2021"}, {"title": "A Farewell to Arms (Ernest Hemingway)", "page": ["229"], "location": ["3106"], "highlight": "We could feel alone when we were together, alone against the others.", "date": "06/23/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["7"], "location": ["102", "103"], "highlight": "Animals are said to belong to the same species if they tend to mate with each other, giving birth to fertile offspring.", "date": "06/24/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["8"], "location": ["109", "108"], "highlight": "Species that evolved from a common ancestor are bunched together under the heading genus (plural genera).", "date": "06/24/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["26"], "location": ["387"], "highlight": "time talking behind each others backs  a much maligned", "date": "06/28/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["3"], "location": ["387"], "highlight": "those who have no backing of experience. This is a platitude.", "date": "07/28/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["95"], "location": ["1449", "1450"], "highlight": "grinding and other tasks, hitherto performed by human sinew,", "date": "09/02/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["150"], "location": ["2292", "2291"], "highlight": "created nature. Christian theologians argued that God created the human body, intending each limb and organ to serve", "date": "10/06/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["179"], "location": ["2736", "2737"], "highlight": "money is the most universal and most efficient system of mutual trust ever devised.", "date": "10/12/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["185"], "location": ["2824", "2823"], "highlight": "whereas religion asks us to believe in something, money asks us to believe that other people believe in something.", "date": "10/14/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["185"], "location": ["2825"], "highlight": "root of all evil. Be that as it may, money is also the apogee", "date": "10/14/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["25"], "location": ["736", "734"], "highlight": "The idea is that the ultimate fact of experience must not be enslaved by any artificial or schematic laws of thought, nor by any antithesis of yes and no, nor by any cut and dried formulae of epistemology. Evidently Zen commits absurdities and irrationalities all the time; but this only apparently.", "date": "12/29/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["29"], "location": ["794", "792"], "highlight": "Zen wants us to acquire an entirely new point of view whereby to look into the mysteries of life and the secrets of nature. This is because Zen has come to the definite conclusion that the ordinary logical process of reasoning is powerless to give final satisfaction to our deepest spiritual needs.", "date": "12/29/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["29"], "location": ["797", "796"], "highlight": "When words cease to correspond with facts it is time for us to part with words and return to facts.", "date": "12/29/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["30"], "location": ["808", "812"], "highlight": "The flower is not red, the willow is not green. This is regarded by Zen devotees as most refreshingly satisfying. So long as we think logic final we are chained, we have no freedom of spirit, and the real facts of life are lost sight of. Now, however, we have the key to the whole situation; we are master of realities; words have given up their domination over us. If we are pleased to call a spade not a spade, we have the perfect right to do so; a spade need not always remain a spade; and, moreover, this, according to the Zen master, expresses more correctly the state of reality which refuses to be tied up to names.", "date": "12/29/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["31"], "location": ["819", "818"], "highlight": "Zen deals with facts and not with their logical, verbal, prejudiced, and lame representations. Direct simplicity is the soul of Zen; hence its vitality, freedom, and originality.", "date": "12/29/2021"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["34"], "location": ["878", "877"], "highlight": "Life, according to Zen, ought to be lived as a bird flies through the air or as a fish swims in the water.", "date": "12/29/2021"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["202"], "location": ["3097", "3096"], "highlight": "bigotry. Perhaps you could make a case that some of the myriad", "date": "01/08/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["227"], "location": ["3476"], "highlight": "ideologies, and that some of them, most notably liberalism,", "date": "01/11/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["235"], "location": ["3594", "3596"], "highlight": "Every point in history is a crossroads. A single travelled road leads from the past to the present, but myriad paths fork off into the future. Some of those paths are wider, smoother and better marked, and are thus more likely to be taken, but sometimes history  or the people", "date": "01/11/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["235"], "location": ["3594", "3596"], "highlight": "Every point in history is a crossroads. A single travelled road leads from the past to the present, but myriad paths fork off into the future. Some of those paths are wider, smoother and better marked, and are thus more likely to be taken, but sometimes history  or the people who make history  takes unexpected turns.", "date": "01/11/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["238"], "location": ["3641", "3639"], "highlight": "Level two chaos is chaos that reacts to predictions about it, and therefore can never be predicted accurately. Markets, for example, are a level two chaotic system. What will happen if we develop a computer program that forecasts with 100 per cent accuracy the price of oil tomorrow? The price of oil will immediately react to the forecast, which would consequently fail to materialise.", "date": "01/11/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["240"], "location": ["3677", "3680"], "highlight": "This approach is sometimes called memetics. It assumes that, just as organic evolution is based on the replication of organic information units called genes, so cultural evolution is based on the replication of cultural information units called memes.1 Successful cultures are those that excel in reproducing their memes, irrespective of the costs and benefits to their human hosts.", "date": "01/12/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["249"], "location": ["3809"], "highlight": "In other cases, competing scientific theories are vociferously", "date": "01/12/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["41"], "location": ["980", "977"], "highlight": "Zen abhors repetition or imitation of any kind, for it kills. For the same reason Zen never explains, but only affirms. Life is fact and no explanation is necessary or pertinent. To explain is to apologize, and why should we apologize for living? To liveis that not enough? Let us then live, let us affirm! Herein lies Zen in all its purity and in all its nudity as well.", "date": "01/14/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["42"], "location": ["1006", "1004"], "highlight": "Copying is slavery. The letter must never be followed, only the spirit is to be grasped. Higher affirmations live in the spirit. And where is the spirit? Seek it in your everyday experience, and therein lies abundance of proof for all you need.", "date": "01/14/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["320"], "location": ["4902", "4906"], "highlight": "While VOC operated in the Indian Ocean, the Dutch West Indies Company, or WIC, plied the Atlantic. In order to control trade on the important Hudson River, WIC built a settlement called New Amsterdam on an island at the rivers mouth. The colony was threatened by Indians and repeatedly attacked by the British, who eventually captured it in 1664. The British changed its name to New York. The remains of the wall built by WIC to defend its colony against Indians and British are today paved over by the worlds most famous street  Wall Street.", "date": "01/22/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["324"], "location": ["4969", "4968"], "highlight": "enough and rebelled. They declared a unilateral abrogation", "date": "01/23/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["324"], "location": ["4969", "4968"], "highlight": "had had enough and rebelled. They declared a unilateral", "date": "01/23/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["347"], "location": ["5314", "5313"], "highlight": "Obesity is a double victory for consumerism. Instead of eating little, which will lead to economic contraction, people eat too much and then buy diet products  contributing to economic growth twice over.", "date": "01/24/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["385"], "location": ["5895"], "highlight": "Theres no natural selection for happiness as such  a happy", "date": "01/31/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["385"], "location": ["5896", "5895"], "highlight": "Theres no natural selection for happiness as such  a happy hermits genetic line will go extinct as the genes of a pair of anxious parents get carried on to the next generation.", "date": "01/31/2022"}, {"title": "Sapiens: A Brief History of Humankind (Yuval Noah Harari)", "page": ["390"], "location": ["5972", "5971"], "highlight": "happiness is not the surplus of pleasant over unpleasant moments. Rather, happiness consists in seeing ones life in its entirety as meaningful and worthwhile.", "date": "02/01/2022"}, {"title": "Leaders Eat Last Deluxe (Sinek, Simon)", "page": ["26"], "location": ["468", "471"], "highlight": "Intimidation, humiliation, isolation, feeling dumb, feeling useless and rejection are all stresses we try to avoid inside the organization. But the danger inside is controllable and it should be the goal of leadership to set a culture free of danger from each other. And the way to do that is by giving people a sense of belonging. By offering them a strong culture based on a clear set of human values and beliefs. By giving them the power to make decisions. By offering trust and empathy. By creating a Circle of Safety.", "date": "03/14/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["55"], "location": ["1224", "1217"], "highlight": "But here is a dangerous loophole which the student of Zen ought to be especially careful to avoid. Zen must never be confused with naturalism or libertinism, which means to follow ones natural bent without questioning its origin and value. There is a great difference between human action and that of the animals, which are lacking in moral intuition and religious consciousness. The animals do not know anything about exerting themselves in order to improve their conditions or to progress in the way to higher virtues. Sekkyo was one day working in the kitchen when Baso, his Zen teacher, came in and asked what he was doing. I am herding the cow, said the pupil. How do you attend her? If she goes out of the path even once, I pull her back straightway by the nose; not a moments delay is allowed. Said the master, You truly know how to take care of her. This is not naturalism. Here is an effort to do the right thing.", "date": "03/22/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["56"], "location": ["1234", "1239"], "highlight": "The mind, answered the master, abides where there is no abiding. What is meant by there is no abiding? When the mind is not abiding in any particular object, we say that it abides where there is no abiding. What is meant by not abiding in any particular object? It means not to be abiding in the dualism of good and evil, being and non-being, thought and matter; it means not to be abiding in emptiness or in non-emptiness, neither in tranquillity nor in non-tranquillity. Where there is no abiding place, this is truly the abiding place for the mind.", "date": "03/22/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["62"], "location": ["1325", "1324"], "highlight": "Therefore, there is in Zen nothing to explain, nothing to teach, that will add to your knowledge. Unless it grows out of yourself no knowledge is really yours, it is only a borrowed plumage.", "date": "03/23/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["65"], "location": ["1365", "1362"], "highlight": "Ever since the unfoldment of consciousness we have been led to respond to the inner and outer conditions in a certain conceptual and analytical manner. The discipline of Zen consists in upsetting this groundwork once for all and reconstructing the old frame on an entirely new basis. It is evident, therefore, that meditating on metaphysical and symbolical statements, which are products of a relative consciousness, play no part in Zen.", "date": "03/23/2022"}, {"title": "An Introduction to Zen Buddhism (D.T. Suzuki)", "page": ["97"], "location": ["1866", "1865"], "highlight": "This inscrutability is not necessarily caused by the abstruse", "date": "04/27/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["29"], "location": ["563", "560"], "highlight": "It is not like going out in a shower in which you know when you get wet. In a fog, you do not know you are getting wet, but as you keep walking you get wet little by little. If your mind has ideas of progress, you may say, Oh, this pace is terrible! But actually it is not. When you get wet in a fog it is very difficult to dry yourself.", "date": "04/30/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["56"], "location": ["850", "852"], "highlight": "You become discouraged with your practice when your practice has been idealistic. You have some gaining idea in your practice, and it is not pure enough. It is when your practice is rather greedy that you become discouraged with it.", "date": "05/01/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["59"], "location": ["892", "889"], "highlight": "Joshu, a great Chinese Zen master, said, A clay Buddha cannot cross water; a bronze Buddha cannot get through a furnace; a wooden Buddha cannot get through fire. Whatever it is, if your practice is directed toward some particular object, such as a clay, a bronze, or a wooden Buddha, it will not always work. So as long as you have some particular goal in your practice, that practice will not help you completely.", "date": "05/01/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["75"], "location": ["1096", "1099"], "highlight": "To be quite natural to ourselves, and also to follow what others say or do in the most appropriate way, is quite difficult. If we try to adjust ourselves intentionally in some way, it is impossible to be natural. If you try to adjust yourself in a certain way, you will lose yourself. So without any intentional, fancy way of adjusting yourself, to express yourself freely as you are is the most important thing to make yourself happy, and to make others happy.", "date": "05/01/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["86"], "location": ["1212", "1216"], "highlight": "According to the traditional Buddhist understanding, our human nature is without ego. When we have no idea of ego, we have Buddhas view of life. Our egoistic ideas are delusion, covering our Buddha nature. We are always creating and following them, and in repeating this process over and over again, our life becomes completely occupied by ego-centered ideas. This is called karmic life, or karma. The Buddhist life should not be karmic life. The purpose of our practice is to cut off the karmic spinning mind. If you are trying to attain enlightenment, that is a part of karma, you are creating and being driven by karma, and you are wasting your time on your black cushion.", "date": "05/02/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["87"], "location": ["1225", "1228"], "highlight": "If you want to see something, you should open your eyes. When you do not understand Bodhidharmas Zen, you are trying to look at something with your eyes closed. We do not slight the idea of attaining enlightenment, but the most important thing is this moment, not some day in the future. We have to make our effort in this moment. This is the most important thing for our practice.", "date": "05/02/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["92"], "location": ["1290"], "highlight": "freedom of your being, even though you are just a temporal", "date": "05/02/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["98"], "location": ["1369", "1365"], "highlight": "To begin with, you must give up the idea of substantiality or existence. The usual view of life is firmly rooted in the idea of existence. For most people everything exists; they think whatever they see and whatever they hear exists. Of course the bird we see and hear exists. It exists, but what I mean by that may not be exactly what you mean. The Buddhist understanding of life includes both existence and non-existence. The bird both exists and does not exist at the same time. We say that a view of life based on existence alone is heretical. If you take things too seriously, as if they existed substantially or permanently, you are called a heretic.", "date": "05/03/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["99"], "location": ["1379", "1382"], "highlight": "Each one of us must make his own true way, and when we do, that way will express the universal way. This is the mystery. When you understand one thing through and through, you understand everything. When you try to understand everything, you will not understand anything. The best way is to understand yourself, and then you will understand everything. So when you try hard to make your own way, you will help others, and you will be helped by others.", "date": "05/03/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["100"], "location": ["1405", "1401"], "highlight": "Concentration is not to try hard to watch something. In zazen if you try to look at one spot you will be tired in about five minutes. This is not concentration. Concentration means freedom. So your effort should be directed at nothing. You should be concentrated on nothing. In zazen practice we say your mind should be concentrated on your breathing, but the way to keep your mind on your breathing is to forget all about yourself and just to sit and feel your breathing. If you are concentrated on your breathing you will forget yourself, and if you forget yourself you will be concentrated on your breathing.", "date": "05/03/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["103"], "location": ["1432", "1429"], "highlight": "This kind of misunderstanding will vanish if you really understand emptiness means everything is always here. One whole being is not an accumulation of everything. It is impossible to divide one whole existence into parts. It is always here and always working. This is enlightenment. So there actually is no particular practice. In the sutra it says, There are no eyes, no ears, no nose, no tongue, no body or mind. This no mind is Zen mind, which includes everything.", "date": "05/03/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["103"], "location": ["1433", "1437"], "highlight": "We should accept things as they are without difficulty. Our mind should be soft and open enough to understand things as they are. When our thinking is soft, it is called imperturbable thinking. This kind of thinking is always stable. It is called mindfulness. Thinking which is divided in many ways is not true thinking. Concentration should be present in our thinking. This is mindfulness. Whether you have an object or not, your mind should be stable and your mind should not be divided. This is zazen.", "date": "05/03/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["103"], "location": ["1439", "1444"], "highlight": "Mindfulness is, at the same time, wisdom. By wisdom we do not mean some particular faculty or philosophy. It is the readiness of the mind that is wisdom. So wisdom could be various philosophies and teachings, and various kinds of research and studies. But we should not become attached to some particular wisdom, such as that which was taught by Buddha. Wisdom is not something to learn. Wisdom is something which will come out of your mindfulness. So the point is to be ready for observing things, and to be ready for thinking. This is called emptiness of your mind. Emptiness is nothing but the practice of zazen.", "date": "05/03/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["118"], "location": ["1622", "1617"], "highlight": "We should establish our practice where there is no practice or enlightenment. As long as we practice zazen in the area where there is practice and enlightenment, there is no chance to make perfect peace for ourselves. In other words, we must firmly believe in our true nature. Our true nature is beyond our conscious experience. It is only in our conscious experience that we find practice and enlightenment or good and bad. But whether or not we have experience of our true nature, what exists there, beyond consciousness, actually exists, and it is there that we have to establish the foundation of our practice.", "date": "05/06/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["119"], "location": ["1637", "1633"], "highlight": "So to have a firm conviction in the original emptiness of your mind is the most important thing in your practice. In Buddhist scriptures we sometimes use vast analogies in an attempt to describe empty mind. Sometimes we use an astronomically great number, so great it is beyond counting. This means to give up calculating. If it is so great that you cannot count it, then you will lose your interest and eventually give up. This kind of description may also give rise to a kind of interest in the innumerable number, which will help you to stop the thinking of your small mind.", "date": "05/06/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["121"], "location": ["1665", "1658"], "highlight": "Usually religion develops itself in the realm of consciousness, seeking to perfect its organization, building beautiful buildings, creating music, evolving a philosophy, and so forth. These are religious activities in the conscious world. But Buddhism emphasizes the world of unconsciousness. The best way to develop Buddhism is to sit in zazenjust to sit, with a firm conviction in our true nature. This way is much better than to read books or study the philosophy of Buddhism. Of course it is necessary to study the philosophyit will strengthen your conviction. Buddhist philosophy is so universal and logical that it is not just the philosophy of Buddhism, but of life itself. The purpose of Buddhist teaching is to point to life itself existing beyond consciousness in our pure original mind. All Buddhist practices were built up to protect this true teaching, not to propagate Buddhism in some wonderful mystic way. So when we discuss religion, it should be in the most common and universal way. We should not try to propagate our way by wonderful philosophical thought.", "date": "05/06/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["123"], "location": ["1693", "1688"], "highlight": "Wherever we go, we should not lose this way of life. That is called being Buddha, or being the boss. Wherever you go you should be the master of your surroundings. This means you should not lose your way. So this is called Buddha, because if you exist in this way always, you are Buddha himself. Without trying to be Buddha you are Buddha. This is how we attain enlightenment. To attain enlightenment is to be always with Buddha. By repeating the same thing over and over, we will acquire this kind of understanding. But if you lose this point and take pride in your attainment or become discouraged because of your idealistic effort, your practice will confine you by a thick wall.", "date": "05/07/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["129"], "location": ["1752", "1748"], "highlight": "If we practice hard, concentrate on zazen, and organize our life so that we can sit well, we will find out what we are doing. But you have to be careful in the rules and way you establish. If it is too strict you will fail, if it is too loose, the rules will not work. Our way should be strict enough to have authority, an authority everyone should obey. The rules should be possible to observe. This is how Zen tradition was built up, decided little by little, created by us in our practice. We cannot force anything. But once the rules have been decided, we should obey them completely until they are changed.", "date": "05/07/2022"}, {"title": "Zen Mind, Beginner's Mind (Suzuki, Shunryu)", "page": ["130"], "location": ["1774", "1778"], "highlight": "You are quite free from material things and you begin Zen practice with a very pure mind, a beginners mind. You can understand Buddhas teaching exactly as he meant it. But we must not be attached to America, or Buddhism, or even to our practice. We must have beginners mind, free from possessing anything, a mind that knows everything is in flowing change. Nothing exists but momentarily in its present form and color. One thing flows into another and cannot be grasped. Before the rain stops we hear a bird. Even under the heavy snow we see snowdrops and some new growth. In the East I saw rhubarb already. In Japan in the spring we eat cucumbers.", "date": "05/07/2022"}]}